{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "batch_input_shape": [null, 150, 150, 3], "filters": 32, "data_format": "channels_last", "name": "conv2d_3", "activation": "relu", "dtype": "float32", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "filters": 32, "data_format": "channels_last", "name": "conv2d_4", "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "dense_3", "activation": "relu", "units": 500, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "dense_4", "activation": "sigmoid", "units": 5, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}